package com.bignerdranch.android.zhihunews.JSONData;

import java.util.List;

/**
 * Created by LENOVO on 2017/2/2.
 */

public class LongCommitsData {
    /**
     * comments : [{"author":"棍棍_風暴之灵","content":"不敢苟同作者的观点，在你眼中可能四线城市甚至是县城更多的是无知、愚昧、落后。但是我只能说你就像带着有色眼镜一样去否定一个国家最基本的组成单元，北京就真的能摒除这所谓的世俗了么？其实哪里都是一样的，只是外在的表象在你心中的印象不同罢了。","avatar":"http://pic3.zhimg.com/b06dca0a55ed7b263449b013c1bef5fa_im.jpg","time":1480996207,"id":27431257,"likes":2},{"author":"西西利亚王","content":"我觉得现在人有个误区就是在老家都是讲人情要应酬，而在北京就可以靠自己奋斗而功成名就。其实在北京也一样，只是北京太大了，你没背景连那些应酬的圈子都进不了，你一直奋斗却连玻璃天花板都看不到，不是没有，是你还没到那份上。","avatar":"http://pic4.zhimg.com/ff9b0b0af_im.jpg","time":1480612923,"id":27383398,"likes":92},{"author":"邓 C 云  ร๒ภภץ","content":"纯属在老家金字塔待腻了有条件去北京体验小老百姓的生活。就没考虑小城市小老百姓的生活？现在获取知识多方便一定要去图书馆？去趟三亚有什么优越感？说到优越感，我们班小朋友圣诞个节满世界玩也算常态。城市资源不同，各有所依，各取所需而已。","avatar":"http://pic2.zhimg.com/366d9789290b1368959b75a7fdbe4979_im.jpg","time":1480609434,"id":27383033,"likes":7},{"author":"西河娃娃","content":"我觉得其实吧，合适自己的才是最好的。只不过就是在大城市当小市民和在小城市当小市民的区别而已。有一年过年在老家，我一个在大城市生活了很多年的长辈突然有感而发说哎呀你看家里的这些人，多可怜啊，过年就是看看大戏烧点鞭炮，一点意思都没有。可是在大多数\u201c家里人\u201d看来，在大城市过年才是最无趣的，除了逛个花街就没其它好玩的了。\n并不能说他们两种人谁对谁错，因为他们觉得就是他们自己的方式有趣，那就按照你的方式来过你的人生啊。","avatar":"http://pic2.zhimg.com/3640055d8884c31a47aa7ccb675f0ed1_im.jpg","time":1480600241,"id":27381387,"likes":5},{"author":"自由日子","content":"赞同。作者在不伤害别人的前提下编写自己的故事，日报小编如果能暂弃文采与结构，而更注重故事的实在性与感悟性的话，这会让我更佩服知乎日报，其他的东西可以从别处补回，但是我从作者这确实了解到了，他这一路走来的所处社会关系的实在感悟，给点鼓励吧。","avatar":"http://pic1.zhimg.com/da8e974dc_im.jpg","time":1480583614,"reply_to":{"content":"我觉得题主只是想分享他自己的心路历程而已。大家都说的对，谁都没有权利指责谁，每个人都有自己的活法，利认同，这就是言论自由。","status":0,"id":27376545,"author":"tom Lau"},"id":27379199,"likes":12},{"author":"冀某某","content":"还不友家乡那一套，也不是所有创业者都会像你这样。","avatar":"http://pic4.zhimg.com/68306a8b74adbdc0a1847a29f2f39c4f_im.jpg","time":1480583399,"id":27379176,"likes":16},{"author":"碳烤小绵羊","content":"以前看见过答主的回答，对名字有点印象。看了一段总瞧不起普罗大众的。","avatar":"http://pic1.zhimg.com/344949a367b87d506167c3efbd5346bc_im.jpg","time":1480581441,"id":27379005,"likes":46},{"author":"vogel","content":"就题论题，以这篇文章为例，典型的逻辑不自洽。\n整体框架上，答主首先描绘他在家乡的声色犬马，占了行文大半内容；北京喝酒一事后又大段抒发啊。","avatar":"http://pic4.zhimg.com/b1e134c53_im.jpg","time":1480580615,"reply_to":{"content":"首先说明我没有攻击的意思，我想请教怎么写或者是怎样的格式才是有相当逻辑的文章？","status":0,"id":27373573,"author":"小小大人物的天使"},"id":27378950,"likes":14},{"author":"八点","content":"看你想养猪还是想做其他的某些工作啊。\n我觉得虽然很多人都知道养猪，开饭店能赚不少钱，可大家或懒惰，或娇弱，或更喜欢体面的工作，或不是不能就是单纯的不喜欢养猪，那么就不会选养猪了。\n其他人我不知道，我这种有具体的研究方向，专业领域并且喜欢这个专业的人，还真的没办法看到某件旁的职业很赚钱就跳过去做那个。","avatar":"http://pic4.zhimg.com/245b81b26341be22680bda83fdcb9bff_im.jpg","time":1480574528,"id":27378106,"likes":1},{"author":"棉棉","content":"感觉楼主真的太有优越感了，觉得自己见识多虽然穷但是很开心。          你接触的人是什么样的你就觉得老家的人都是这样子的，据我所理解的你文章中表示的都是跟混社会的地头蛇？都是在跟混混打交道。        可能老家里的人确实是以酒来交朋友，但酒文化是所有地区都是有的。看了你的文章，感觉满满的负能量，感觉整个老家地区都被混社会的混混给包了。 其实好好生活，充满阳光的人有很多，只是你整天跟混混在一起，你没有看到罢了","avatar":"http://pic3.zhimg.com/2e78b4245795fa7250adbb31528dd13a_im.jpg","time":1480567803,"id":27377321,"likes":59},{"author":"Nico","content":"我是无锡姑娘，大学没毕业去了上海。一边工作一边写论文，答辩。然后上海工作七年后28岁决定来芝加哥读MBA。现在在芝加哥工作。我觉得人生决定和性格也有很大关系。当初妈妈希望我留在无锡老家当老师。我实习了两周就跑去上海面试全职。","avatar":"http://pic1.zhimg.com/595773fc59bfd4469dbe9a58a5e36c4c_im.jpg","time":1480567661,"reply_to":{"content":"是呀，我也是北京土著，其实我们面对的压力也很大，能来北京闯世界的都是全国各地的精英，都有不达目的誓不罢休的决心。\n说实话北京人面对的竞争是非常大的，我大概20年前上的班，在国企一年后跳槽到了一家台企，工资是原来的四倍，我想推荐我的同学也去，可是那个同学说，我是北京人，有正经工作，为什么要去伺候人？现在这个同学还住在大杂院，在一个小区做物业维修。\n17年前我结婚，老婆是无锡人，北大毕业，174公分，可是我的很多朋友和同学都嘲笑我，说我居然娶了一个外地人，说最不济的北京人也要娶一个郊区的，我老婆婚后又读了北大的研究生，考了CFA，收入是那些人的十倍，可是偶尔同学见面的时候，他们还是认为我不该娶一个外地人。\n我说这么多其实是觉得北京人才是应该觉醒的，在这么好的地方，也没有退路，就要充分利用自己的身份优势，好好学习，开拓眼界，不要抱残守缺，要勇敢的参与竞争，而不是甩片汤话，骂闲街，说要求外地人都滚蛋一类的可笑话。","status":0,"id":27377091,"author":"雪天宇瞻"},"id":27377278,"likes":13},{"author":"雪天宇瞻","content":"是呀，我也是北京土著，其实我们面对的压力也很大，能来北京闯世界的都是全国各地的精英，都有不达目的誓不罢休的决心。\n说实话北京人面对的竞争是非常大的，我大概20年前上的班，在国企一年后跳槽到了一家台企，工资是原来的四倍，我想推荐我的同学也去，可是那个同学说，我是北京人，有正经工作，为什么要去伺候人？现在这个同学还住在大杂院，在一个小区做物业维修。\n17年前我结婚，老婆是无锡人，北大毕业，174公分，可是我的很多朋友和同学都嘲笑我，说我居然娶了一个外地人，说最不济的北京人也要娶一个郊区的，我老婆婚后又读了北大的研究生，考了CFA，收入是那些人的十倍，可是偶尔同学见面的时候，他们还是认为我不该娶一个外地人。\n我说这么多其实是觉得北京人才是应该觉醒的，在这么好的地方，也没有退路，就要充分利用自己的身份优势，好好学习，开拓眼界，不要抱残守缺，要勇敢的参与竞争，而不是甩片汤话，骂闲街，说要求外地人都滚蛋一类的可笑话。","avatar":"http://pic1.zhimg.com/bf236b0e4c7f5a30131527354ab3d4f8_im.jpg","time":1480566494,"reply_to":{"content":"北京姑娘，其实特别不理解北京为什么一直被外地的朋友骂来骂去但还甘之如饴。不是地域黑，只是不明白。看了答主的文章跟您的回复，我有点懂了，超级城市带给人们的诱惑和吸引力是土著无法体会跟想象的。不过，享受了超级城市的发展也得扛得住超级城市的房价，这也是非常刺激的！","status":0,"id":27376534,"author":"范羽羽"},"id":27377091,"likes":22},{"author":"蓄眉警长","content":"学会接受遗憾的，学会珍惜现有的是每一个人都要面对的问题，不管你是大城市的奋斗者，还是小城市的小市民。大部分的人都要舍弃内心的一部分欲望，才能从容接受现在的生活。在解决这个问题之前，我们每个人都会和题主一样内心纠结。\n我觉得并没有那么多好与不好。不管大城市还是小城市，最终做决定的还是自己，你可以随着当地的环境积极融入，也可以清者自清，坚持自己的道路。\n身边也有在小城市人活出自己的风格。也有北上广迷失在名为奋斗的潮流中。\n世界上风景那么多，永远都不会看尽，关键是要明白什么样最适合自己。很多时候我们眼中别人盘里可口的菜，自己吃起来就不一定仍然美味。拿别人的生活去考量自己不是最离谱的错误么？","avatar":"http://pic1.zhimg.com/ec490b9d95e07ba107f50672fdbe2f64_im.jpg","time":1480562881,"id":27376581,"likes":4},{"author":"tom Lau","content":"我觉得题主只是想分享他自己的心路历程而已。大家都说的对，谁都没有权利指责谁，每个人都有自己的活法，你可以醉生梦死，你也可以每日拼搏，甚至还可以终日乞讨，只要不伤害到别人，没有谁比谁更高尚。但是站在题主自己的角度上，经历过这么多事以后，他只是对自己的过去做出总结，并对自己的未来做出判断，仅此而已，你有权利反对，有权利认同，这就是言论自由。","avatar":"http://pic3.zhimg.com/61e8788f2_im.jpg","time":1480562645,"id":27376545,"likes":10},{"author":"范羽羽","content":"北京姑娘，其实特别不理解北京为什么一直被外地的朋友骂来骂去但还甘之如饴。不是地域黑，只是不明白。看了答主的文章跟您的回复，我有点懂了，超级城市带给人们的诱惑和吸引力是土著无法体会跟想象的。不过，享受了超级城市的发展也得扛得住超级城市的房价，这也是非常刺激的！","avatar":"http://pic1.zhimg.com/da8e974dc_im.jpg","time":1480562620,"reply_to":{"content":"今天刚跟一位回老家结婚，又出差到北京的前同事吃饭，她以前再北京租了一个很旧的老房子，挣得不少，但是月光，因为喜欢玩，是三里屯的常客，在北京十几年，去年回老家嫁了一个当地的企业家，现在住四个别墅组成的大宅院(我实在不知道怎么形容)，面积已经没法算了，别的细节就不多说了，反正感觉比的上刘文彩了。\n可以她很不喜欢，因为她说眼睛封住了，在北京每天都有新鲜事，以前经常到国外出差，眼界就更丰富了，刚结婚的时候老公要她就在家里，不到一年感觉就傻了，她说我都快忘了自己是北大研究生了，后来进了一个当地的有政府背景的智库公司，能经常出差，她的气才透出来。\n所以在北上广图的是什么？浅了说是热闹，深了说是眼界，出国也是一样，不过现在几乎最能开眼界看到新东西的地方到是北上广。\n日本，美国，澳洲，欧洲这些地方总体来说变化不大，甚至给人一些破败感，估计北上广30年后也是这样。\n没必要说什么苟且还是远方，一个人能自由的按照自我意志走动的时间不会超过50年，干嘛不多看看呢？在地球这个孤岛上去看看每一个角落也是很有意思的。\n可能我之前的工作是大量出差，所以比较习惯抬腿就走，没什么顾虑，后来自己和跟家人去的地方很多，看了很多，不一定改变什么价值观，能看看不一样的风土人情总是好的。\n胡说了很多，我是想养猪还是在北京都不妨碍出去走走看看，养猪也有出栏的时候。","status":0,"id":27372567,"author":"雪天宇瞻"},"id":27376534,"likes":2},{"author":"Miss_Sha_sha","content":"翻了翻知乎原问题，养猪问题是2014年2月提出，题主为2014年4月成立的西少爷肉夹馍创始人之一。。。还是很励志的好么～我本人大约也是题主口中县城的小同学，然而我身边的朋友基本没有喝酒的，大家工作之余都很努力向上，闲暇时也只是相约健身或出游～小编选择此文略显片面了，实在不符合知乎君的格调啊～","avatar":"http://pic4.zhimg.com/4b41922b80cf8e888a39fc1eb0ff27db_im.jpg","time":1480562022,"id":27376404,"likes":18},{"author":"此去经年","content":"整篇文章写的特别乱中心思想也前后不同。\n\n这个世界这么大，每个人有每个人的活法，不管在哪里生活，我觉得最糟糕的活法就是我得比一个和我都不在一个世界却曾经有联系的人过的优秀、逼格高、有钱、环境好等等\u2026\n尊重他人，内心富足。把自己经营的更好，为人善良，不作恶，尽量满足自己的一些小喜好，承认自己的局限和不足，不自卑，勇敢面对生活。这些不论在哪个环境生活都很重要。\n如果贬低一个和你都不在一个世界的人来获取比较之后胜利了的满足感，窃喜一番，再感叹，啊，确实大部分人都是普通人呀。\n这真的是太糟糕了。","avatar":"http://pic2.zhimg.com/5ccabba20ef03e78ef50ce89b5e2d375_im.jpg","time":1480559671,"id":27376137,"likes":29},{"author":"人心需要野","content":"对。现在我也是这样的人（笑）。我也是如此想的。我觉得每一个人都应该在不同的年龄有不同的想法，这样才能体验人生的快感。我现在由衷的鄙视混吃等死类的社交方式，也发自内心的想逃离出\u201c二十岁就开始进入养老节奏\u201d的这么一个城市。但这些，和将来三十岁的我在大城市碌碌无为最终回到家乡做些小买卖幸福生活并不冲突。在没有被打败之前，可能我们这样年轻的人都拥有\u201c优越感\u201d。\n我赞同你的逻辑和结论。","avatar":"http://pic1.zhimg.com/ec182f2bf7ba02ae462c374a711db0b4_im.jpg","time":1480559483,"reply_to":{"content":"看了开头就不想看了 什么\u201c尽管我现在遭受嫌弃 至少我看得起了自己\u201d？ 那在老家的同学说不定也是这样看你的哦 他们可能也会觉得你\u201c在大城市忙得要死要活 还不如我在老家有房有车来得快活\u201d。每个人都有自己喜欢的生活方式，感觉楼主还是挺有优越感的，觉得\u201c你们终将都会成为小市民，而我虽然没那么有钱，但我比你们有逼格，我精神不死\u201d","status":0,"id":27376070,"author":"ewillflow"},"id":27376120,"likes":1},{"author":"ewillflow","content":"看了开头就不想看了 什么\u201c尽管我现在遭受嫌弃 至少我看得起了自己\u201d？ 那在老家的同学说不定也是这样看你的哦 他们可能也会觉得你\u201c在大城市忙得要死要活 还不如我在老家有房有车来得快活\u201d。每个人都有自己喜欢的生活方式，感觉楼主还是挺有优越感的，觉得\u201c你们终将都会成为小市民，而我虽然没那么有钱，但我比你们有逼格，我精神不死\u201d","avatar":"http://pic4.zhimg.com/9eea0fc11c16eac907b043ca70041ce7_im.jpg","time":1480559042,"id":27376070,"likes":12},{"author":"木爻木大心亘兮士心鸷鸟不群","content":"老家是中原的一个小县城，老家的家族混的挺出，关系网亦都很广。大学之前就没想过出老家，因为几代的关系网、亲朋好友、小初高同学都在这里，会活的很舒服很安逸，做什么事也都会有办法。而在我接受4年高等（比较高等）教育、出来在大城市生活过后，我一时觉得很迷茫\u2026\u2026是回老家与朋友日日笙歌？还是在大城市踽踽独行？讲真我现在在老家并不快乐。生意没有，应酬挺多，大多都是泛泛之交脸熟而已，老家都认为多条朋友多条路，所以都近乎疯狂地在外面社交（喝酒）。我觉得这是本末倒置，没有实力没有能力，关系再多，真正伸手拉你的的又有几个？现在我与老家的哥们朋友已有代沟了，讲不到一起去，思想真的觉得很有差别（我并不是说看不起他们的思想，就像文章里说的，子非鱼，安知鱼之乐）。我一直很犹豫，无非就是老家的安逸环境和关系网在吸引着我。但是我心之所向显而易见。","avatar":"http://pic3.zhimg.com/5c14bfc87bdabd5c2370f95239063f66_im.jpg","time":1480557448,"id":27375870,"likes":0}]
     */

    private List<CommentsEntity> comments;

    public void setComments(List<CommentsEntity> comments) {
        this.comments = comments;
    }

    public List<CommentsEntity> getComments() {
        return comments;
    }

    public static class CommentsEntity {
        /**
         * author : 棍棍_風暴之灵
         * content : 不敢苟同作者的观点，在你眼中可能四线城市甚至是县城更多的是无知、愚昧、落后。但是我只能说你就像带着有色眼镜一样去否定一个国家最基本的组成单元，北京就真的能摒除这所谓的世俗了么？其实哪里都是一样的，只是外在的表象在你心中的印象不同罢了。
         * avatar : http://pic3.zhimg.com/b06dca0a55ed7b263449b013c1bef5fa_im.jpg
         * time : 1480996207
         * id : 27431257
         * likes : 2
         */

        private String author;
        private String content;
        private String avatar;
        private int time;
        private int id;
        private int likes;

        public void setAuthor(String author) {
            this.author = author;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public void setAvatar(String avatar) {
            this.avatar = avatar;
        }

        public void setTime(int time) {
            this.time = time;
        }

        public void setId(int id) {
            this.id = id;
        }

        public void setLikes(int likes) {
            this.likes = likes;
        }

        public String getAuthor() {
            return author;
        }

        public String getContent() {
            return content;
        }

        public String getAvatar() {
            return avatar;
        }

        public int getTime() {
            return time;
        }

        public int getId() {
            return id;
        }

        public int getLikes() {
            return likes;
        }
    }
}
